package UserRelated;

public class StringsForMessages {

    public static String message1() {
        return "\uD83C\uDF81 Мы любим дарить подарки, а также для нас очень важна Ваша обратная связь, чтобы развиваться и быть еще лучше! " +
                "Поэтому мы решили совместить приятное с полезным! \n" +
                "\uD83D\uDCCC Все очень просто: нужно приобрести на любом маркетплейсе все 3 продукта бренда «Лекол» (гель, спрей и сыворотка) " +
                "и написать отзыв на той площадке, где делали покупки. Мы пришлем Вам в подарок один любой продукт бренда «Лекол» на выбор!\n" +
                "Поскольку Вы уже купили сыворотку и узнали об этой акции, то Вам остается приобрести только гель и спрей \uD83D\uDE09\n";

    }

    public static String message2() {
        return "❓Где купить? На любой удобной для вас площадке: WB/OZON/Я.Маркет по кнопке в меню ниже ⬇\uFE0F \n" +
                "❓Как получить подарок? \n" +
                "После публикации трех отзывов (сыворотка/гель/спрей) сделать скриншоты этих отзывов, а также сделать скриншоты из раздела «Заказы»/«Покупки», " +
                "где видно даты данных заказов и даты доставки. Прислать все скриншоты нашему менеджеру и написать какой продукт хотите получить в подарок (сыворотку, гель или спрей). \n" +
                "После проверки Ваших отзывов наш менеджер пришлет вам сообщение с запросом адреса ПВЗ, куда мы отправим Ваш подарок, и позже пришлет штрих-код для его получения. \n";
    }

    public static String message3() {
        return "‼\uFE0F Важно! \n" +
                "В акции участвуют заказы, совершенные с 00:00 (мск) 15 января 2025 г. до 23:59 (мск) " +
                "15 мая 2025 г.\n" +
                "Негативные отзывы по содержанию, а также с рейтингом 4 звезды и ниже не участвуют в акции! \n" +
                "С нетерпением ждём Ваши сообщения! Команда Лекол ❤\uFE0F\n";
    }

    public static String message4() {
        return "Чтобы быть в курсе всех акций и скидок, и не пропускать новинки нашей продукции подписывайтесь " +
                "на наш \uD83D\uDC49 Telegram-канал (жми на слово Telegram-канал)";
    }

    public static String message5() {
        return "\uD83D\uDCE9Чтобы отправить менеджеру скриншоты отзывов и заказов нажмите на кнопку ниже «Связь с нами» => " +
                "«Менеджер Лекол» и в открывшемся диалоге отправьте фото";
    }

}
